{
	"description": "Creates or updates a lifecycle hook for the specified Auto Scaling group. A lifecycle hook tells Amazon EC2 Auto Scaling to perform an action on an instance when the instance launches (before it is put into service) or as the instance terminates (before it is fully terminated). This step is a part of the procedure for adding a lifecycle hook to an Auto Scaling group:   (Optional) Create a Lambda function and a rule that allows CloudWatch Events to invoke your Lambda function when Amazon EC2 Auto Scaling launches or terminates instances.   (Optional) Create a notification target and an IAM role. The target can be either an Amazon SQS queue or an Amazon SNS topic. The role allows Amazon EC2 Auto Scaling to publish lifecycle notifications to the target.    Create the lifecycle hook. Specify whether the hook is used when the instances launch or terminate.    If you need more time, record the lifecycle action heartbeat to keep the instance in a pending state using using RecordLifecycleActionHeartbeat.   If you finish before the timeout period ends, complete the lifecycle action using CompleteLifecycleAction.   For more information, see Amazon EC2 Auto Scaling Lifecycle Hooks in the Amazon EC2 Auto Scaling User Guide. If you exceed your maximum limit of lifecycle hooks, which by default is 50 per Auto Scaling group, the call fails. You can view the lifecycle hooks for an Auto Scaling group using DescribeLifecycleHooks. If you are no longer using a lifecycle hook, you can delete it using DeleteLifecycleHook.",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"heartbeat_timeout":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"lifecycle_hook_name":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"lifecycle_transition":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"notification_metadata":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"notification_target_arn":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"role_arn":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"auto_scaling_group_name":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"default_result":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			
	}
}