{
	"description": "Creates a list of changes that will be applied to a stack so that you can review the changes before executing them. You can create a change set for a stack that doesn't exist or an existing stack. If you create a change set for a stack that doesn't exist, the change set shows all of the resources that AWS CloudFormation will create. If you create a change set for an existing stack, AWS CloudFormation compares the stack's information with the information that you submit in the change set and lists the differences. Use change sets to understand which resources AWS CloudFormation will create or change, and how it will change resources in an existing stack, before you create or update a stack. To create a change set for a stack that doesn't exist, for the ChangeSetType parameter, specify CREATE. To create a change set for an existing stack, specify UPDATE for the ChangeSetType parameter. After the CreateChangeSet call successfully completes, AWS CloudFormation starts creating the change set. To check the status of the change set or to review it, use the DescribeChangeSet action. When you are satisfied with the changes the change set will make, execute the change set by using the ExecuteChangeSet action. AWS CloudFormation doesn't make changes until you execute the change set.",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"capabilities":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"change_set_name":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"change_set_type":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"client_token":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"template_url":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"notification_ar_ns":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"parameters":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"role_arn":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"tags":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"template_body":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"rollback_configuration":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"use_previous_template":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"description":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"resource_types":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"stack_name":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			
	}
}