{
	"description": "You can modify several parameters of an existing EBS volume, including volume size, volume type, and IOPS capacity. If your EBS volume is attached to a current-generation EC2 instance type, you may be able to apply these changes without stopping the instance or detaching the volume from it. For more information about modifying an EBS volume running Linux, see Modifying the Size, IOPS, or Type of an EBS Volume on Linux. For more information about modifying an EBS volume running Windows, see Modifying the Size, IOPS, or Type of an EBS Volume on Windows.   When you complete a resize operation on your volume, you need to extend the volume's file-system size to take advantage of the new storage capacity. For information about extending a Linux file system, see Extending a Linux File System. For information about extending a Windows file system, see Extending a Windows File System.   You can use CloudWatch Events to check the status of a modification to an EBS volume. For information about CloudWatch Events, see the Amazon CloudWatch Events User Guide. You can also track the status of a modification using the DescribeVolumesModifications API. For information about tracking status changes using either method, see Monitoring Volume Modifications.  With previous-generation instance types, resizing an EBS volume may require detaching and reattaching the volume or stopping and restarting the instance. For more information, see Modifying the Size, IOPS, or Type of an EBS Volume on Linux and Modifying the Size, IOPS, or Type of an EBS Volume on Windows. If you reach the maximum volume modification rate per volume limit, you will need to wait at least six hours before applying further modifications to the affected EBS volume.",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"dry_run":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"iops":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"size":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"volume_id":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"volume_type":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			
	}
}