{
	"description": "Creates a new Capacity Reservation with the specified attributes. Capacity Reservations enable you to reserve capacity for your Amazon EC2 instances in a specific Availability Zone for any duration. This gives you the flexibility to selectively add capacity reservations and still get the Regional RI discounts for that usage. By creating Capacity Reservations, you ensure that you always have access to Amazon EC2 capacity when you need it, for as long as you need it. For more information, see Capacity Reservations in the Amazon Elastic Compute Cloud User Guide. Your request to create a Capacity Reservation could fail if Amazon EC2 does not have sufficient capacity to fulfill the request. If your request fails due to Amazon EC2 capacity constraints, either try again at a later time, try in a different Availability Zone, or request a smaller capacity reservation. If your application is flexible across instance types and sizes, try to create a Capacity Reservation with different instance attributes. Your request could also fail if the requested quantity exceeds your On-Demand Instance limit for the selected instance type. If your request fails due to limit constraints, increase your On-Demand Instance limit for the required instance type and try again. For more information about increasing your instance limits, see Amazon EC2 Service Limits in the Amazon Elastic Compute Cloud User Guide.",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"end_date":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"end_date_type":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"instance_match_criteria":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"instance_platform":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"tag_specifications":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"client_token":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"dry_run":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"ebs_optimized":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"tenancy":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"instance_type":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"availability_zone":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"ephemeral_storage":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"instance_count":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			
	}
}