{
	"description": "Starts a new task using the specified task definition. You can allow Amazon ECS to place tasks for you, or you can customize how Amazon ECS places tasks using placement constraints and placement strategies. For more information, see Scheduling Tasks in the Amazon Elastic Container Service Developer Guide. Alternatively, you can use StartTask to use your own scheduler or place tasks manually on specific container instances. The Amazon ECS API follows an eventual consistency model, due to the distributed nature of the system supporting the API. This means that the result of an API command you run that affects your Amazon ECS resources might not be immediately visible to all subsequent commands you run. Keep this in mind when you carry out an API command that immediately follows a previous API command. To manage eventual consistency, you can do the following:   Confirm the state of the resource before you run a command to modify it. Run the DescribeTasks command using an exponential backoff algorithm to ensure that you allow enough time for the previous command to propagate through the system. To do this, run the DescribeTasks command repeatedly, starting with a couple of seconds of wait time and increasing gradually up to five minutes of wait time.   Add wait time between subsequent commands, even if the DescribeTasks command returns an accurate response. Apply an exponential backoff algorithm starting with a couple of seconds of wait time, and increase gradually up to about five minutes of wait time.  ",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"placement_constraints":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"placement_strategy":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"platform_version":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"started_by":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"cluster":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"network_configuration":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"tags":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"count":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"enable_ecs_managed_tags":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"group":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"launch_type":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"overrides":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"propagate_tags":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"task_definition":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			
	}
}