{
	"description": "Creates a multiplayer game session for players. This action creates a game session record and assigns an available server process in the specified fleet to host the game session. A fleet must have an ACTIVE status before a game session can be created in it. To create a game session, specify either fleet ID or alias ID and indicate a maximum number of players to allow in the game session. You can also provide a name and game-specific properties for this game session. If successful, a GameSession object is returned containing the game session properties and other settings you specified.  Idempotency tokens. You can add a token that uniquely identifies game session requests. This is useful for ensuring that game session requests are idempotent. Multiple requests with the same idempotency token are processed only once; subsequent requests return the original result. All response values are the same with the exception of game session status, which may change.  Resource creation limits. If you are creating a game session on a fleet with a resource creation limit policy in force, then you must specify a creator ID. Without this ID, Amazon GameLift has no way to evaluate the policy for this new game session request.  Player acceptance policy. By default, newly created game sessions are open to new players. You can restrict new player access by using UpdateGameSession to change the game session's player session creation policy.  Game session logs. Logs are retained for all active game sessions for 14 days. To access the logs, call GetGameSessionLogUrl to download the log files.  Available in Amazon GameLift Local.  Game-session-related operations include:    CreateGameSession     DescribeGameSessions     DescribeGameSessionDetails     SearchGameSessions     UpdateGameSession     GetGameSessionLogUrl    Game session placements    StartGameSessionPlacement     DescribeGameSessionPlacement     StopGameSessionPlacement     ",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"creator_id":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"game_session_data":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"name":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"alias_id":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"fleet_id":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"game_properties":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"game_session_id":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"idempotency_token":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"maximum_player_session_count":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			
	}
}