{
	"description": "Defines a new matchmaking configuration for use with FlexMatch. A matchmaking configuration sets out guidelines for matching players and getting the matches into games. You can set up multiple matchmaking configurations to handle the scenarios needed for your game. Each matchmaking ticket (StartMatchmaking or StartMatchBackfill) specifies a configuration for the match and provides player attributes to support the configuration being used.  To create a matchmaking configuration, at a minimum you must specify the following: configuration name; a rule set that governs how to evaluate players and find acceptable matches; a game session queue to use when placing a new game session for the match; and the maximum time allowed for a matchmaking attempt.  Player acceptance -- In each configuration, you have the option to require that all players accept participation in a proposed match. To enable this feature, set AcceptanceRequired to true and specify a time limit for player acceptance. Players have the option to accept or reject a proposed match, and a match does not move ahead to game session placement unless all matched players accept.   Matchmaking status notification -- There are two ways to track the progress of matchmaking tickets: (1) polling ticket status with DescribeMatchmaking; or (2) receiving notifications with Amazon Simple Notification Service (SNS). To use notifications, you first need to set up an SNS topic to receive the notifications, and provide the topic ARN in the matchmaking configuration (see  Setting up Notifications for Matchmaking). Since notifications promise only 'best effort' delivery, we recommend calling DescribeMatchmaking if no notifications are received within 30 seconds.    CreateMatchmakingConfiguration     DescribeMatchmakingConfigurations     UpdateMatchmakingConfiguration     DeleteMatchmakingConfiguration     CreateMatchmakingRuleSet     DescribeMatchmakingRuleSets     ValidateMatchmakingRuleSet     DeleteMatchmakingRuleSet   ",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"additional_player_count":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"game_session_data":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"game_session_queue_arns":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"name":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"request_timeout_seconds":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"acceptance_required":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"acceptance_timeout_seconds":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"game_properties":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"notification_target":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"rule_set_name":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"custom_event_data":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"description":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			
	}
}