{
	"description": " Creates an Amazon Kinesis Analytics application. You can configure each application with one streaming source as input, application code to process the input, and up to three destinations where you want Amazon Kinesis Analytics to write the output data from your application. For an overview, see How it Works.  In the input configuration, you map the streaming source to an in-application stream, which you can think of as a constantly updating table. In the mapping, you must provide a schema for the in-application stream and map each data column in the in-application stream to a data element in the streaming source. Your application code is one or more SQL statements that read input data, transform it, and generate output. Your application code can create one or more SQL artifacts like SQL streams or pumps. In the output configuration, you can configure the application to write data from in-application streams created in your applications to up to three destinations.  To read data from your source stream or write data to destination streams, Amazon Kinesis Analytics needs your permissions. You grant these permissions by creating IAM roles. This operation requires permissions to perform the kinesisanalytics:CreateApplication action.   For introductory exercises to create an Amazon Kinesis Analytics application, see Getting Started. ",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"application_code":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"application_description":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"application_name":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"cloud_watch_logging_options":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"inputs":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"outputs":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			
	}
}