{
	"description": "Lists the resource record sets in a specified hosted zone.  ListResourceRecordSets returns up to 100 resource record sets at a time in ASCII order, beginning at a position specified by the name and type elements. The action sorts results first by DNS name with the labels reversed, for example:  com.example.www.  Note the trailing dot, which can change the sort order in some circumstances. When multiple records have the same DNS name, the action sorts results by the record type. You can use the name and type elements to adjust the beginning position of the list of resource record sets returned:  If you do not specify Name or Type  The results begin with the first resource record set that the hosted zone contains.  If you specify Name but not Type  The results begin with the first resource record set in the list whose name is greater than or equal to Name.  If you specify Type but not Name  Amazon Route 53 returns the InvalidInput error.  If you specify both Name and Type  The results begin with the first resource record set in the list whose name is greater than or equal to Name, and whose type is greater than or equal to Type.   This action returns the most current version of the records. This includes records that are PENDING, and that are not yet available on all Amazon Route 53 DNS servers. To ensure that you get an accurate listing of the resource record sets for a hosted zone at a point in time, do not submit a ChangeResourceRecordSets request while you're paging through the results of a ListResourceRecordSets request. If you do, some pages may display results without the latest changes while other pages display results with the latest changes.",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"hosted_zone_id":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"start_record_name":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"start_record_type":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"start_record_identifier":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"max_items":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			
	}
}