{
	"description": "Starts a model training job. After training completes, Amazon SageMaker saves the resulting model artifacts to an Amazon S3 location that you specify.  If you choose to host your model using Amazon SageMaker hosting services, you can use the resulting model artifacts as part of the model. You can also use the artifacts in a machine learning service other than Amazon SageMaker, provided that you know how to use them for inferences.  In the request body, you provide the following:     AlgorithmSpecification - Identifies the training algorithm to use.     HyperParameters - Specify these algorithm-specific parameters to influence the quality of the final model. For a list of hyperparameters for each training algorithm provided by Amazon SageMaker, see Algorithms.     InputDataConfig - Describes the training dataset and the Amazon S3 location where it is stored.    OutputDataConfig - Identifies the Amazon S3 location where you want Amazon SageMaker to save the results of model training.      ResourceConfig - Identifies the resources, ML compute instances, and ML storage volumes to deploy for model training. In distributed training, you specify more than one instance.     RoleARN - The Amazon Resource Number (ARN) that Amazon SageMaker assumes to perform tasks on your behalf during model training. You must grant this role the necessary permissions so that Amazon SageMaker can successfully complete model training.     StoppingCondition - Sets a duration for training. Use this parameter to cap model training costs.     For more information about Amazon SageMaker, see How It Works. ",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"output_data_config":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"stopping_condition":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"enable_inter_container_traffic_encryption":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"enable_network_isolation":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"hyper_parameters":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"input_data_config":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"training_job_name":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"vpc_config":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"algorithm_specification":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"resource_config":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"role_arn":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"tags":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			
	}
}