{
	"description": "Creates a job that uses human workers to label the data objects in your input dataset. You can use the labeled data to train machine learning models You can select your workforce from one of three providers:   A private workforce that you create. It can include employees, contractors, and outside experts. Use a private workforce when the data is highly confidential or a specific set of skills is required.   One or more vendors that you select from the Amazon Marketplace. Vendors provide expertise in specific areas. Vendors are selected by AWS and meet a minimum standard of data security requirements.   The Amazon Mechanical Turk workforce. This is the largest workforce, but it should only be used for public data or data that has been stripped of any personally identifiable information.   You can also use automated data labeling to reduce the number of data objects that need to be labeled by a human. Automated data labeling uses active learning to determine if a data object can be labeled by machine or if it needs to be sent to a human worker. The data objects to be labeled are contained in an Amazon S3 bucket. You create a manifest file that describes the location of each object. For more information, see Using Input and Output Data. The output can be used as the manifest file for another labeling job or as training data for your machine learning models.",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"input_config":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"label_attribute_name":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"label_category_config_s3_uri":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"labeling_job_name":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"tags":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"human_task_config":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"labeling_job_algorithms_config":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"output_config":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"role_arn":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"stopping_conditions":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			
	}
}