{
	"description": "Creates a new case in the AWS Support Center. This operation is modeled on the behavior of the AWS Support Center Create Case page. Its parameters require you to specify the following information:     issueType. The type of issue for the case. You can specify either 'customer-service' or 'technical.' If you do not indicate a value, the default is 'technical.'     serviceCode. The code for an AWS service. You obtain the serviceCode by calling DescribeServices.     categoryCode. The category for the service defined for the serviceCode value. You also obtain the category code for a service by calling DescribeServices. Each AWS service defines its own set of category codes.     severityCode. A value that indicates the urgency of the case, which in turn determines the response time according to your service level agreement with AWS Support. You obtain the SeverityCode by calling DescribeSeverityLevels.    subject. The Subject field on the AWS Support Center Create Case page.    communicationBody. The Description field on the AWS Support Center Create Case page.    attachmentSetId. The ID of a set of attachments that has been created by using AddAttachmentsToSet.    language. The human language in which AWS Support handles the case. English and Japanese are currently supported.    ccEmailAddresses. The AWS Support Center CC field on the Create Case page. You can list email addresses to be copied on any correspondence about the case. The account that opens the case is already identified by passing the AWS Credentials in the HTTP POST method or in a method or function call from one of the programming languages supported by an AWS SDK.     To add additional communication or attachments to an existing case, use AddCommunicationToCase.  A successful CreateCase request returns an AWS Support case number. Case numbers are used by the DescribeCases operation to retrieve existing AWS Support cases. ",
	"input_method": "stdin",
	"parameters":{
		
		
		
		
		    
			"issue_type":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"language":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"severity_code":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"subject":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"attachment_set_id":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"category_code":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"cc_email_addresses":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"communication_body":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"service_code":{
			   "description": "",
			   "type": "Optional[String[1]]"
			}
			
	}
}